{
    "name": "Rhys Shaw",
    "contact": {
        "email": "rhysalfshaw@gmail.com",
        "location": "Bristol",
        "website": "rhysalfshaw.com",
        "orcid": "0000-0003-4318-0737",
        "linkedin": "linkedin.com/in/rhysalfshaw",
        "github": "github.com/rhysalfshaw"
    },
    "summary": "Third Year Astrophysics PhD Student at the University of Bristol, with a focus on Machine Learning and Computing.",
    "work_experience": [
        {
            "job_title": "Data Science Intern",
            "company": "Aleph Insights",
            "location": "London, England",
            "start_date": "2024-03-01",
            "end_date": "2024-09-01",
            "description": "Worked on building a internal LLM client tool. This interacted with any LLM API, stored all data locally and allowed for attaching relevant documents from local the network."
        },
        {
            "job_title": "Postgraduate Teaching Assistant",
            "company": "University of Bristol",
            "location": "Bristol, England",
            "start_date": "2021-09-01",
            "end_date": "2022-06-01",
            "description": "Lab demonstration, assisting 2nd year undergraduates in completing their research projects. This required a detailed working knowledge of a number of physics experiements projects. I then accesed them through conducting interviews and marking formal reports."
        }
    ],
    "education": [
        {
            "degree": "PhD in Astrophysics",
            "institution": "University of Bristol",
            "location": "Bristol, England",
            "graduation_year": "2026",
            "thesis": "--"
        },
        {
            "degree": "Master of Science in Data Intensive Astrophysics",
            "institution": "Cardiff University",
            "location": "Cardiff, Wales",
            "graduation_year": "2021",
            "grade": "Distinction",
            "thesis": "The Effect of fractal substructure in early stellar cluster evolution."
        },
        {
            "degree": "Bachelor of Science in Physics with Astrophysics",
            "institution": "University of Bristol",
            "location": "Bristol, England",
            "graduation_year": "2020",
            "grade": "2.1",
            "thesis": "Exporing the bias in X-ray and SZ selected galaxy clusters using galaxy cluster scaling relations."
        }
    ],
    "experience": [
        {
            "title": "DataAid Commitee Member",
            "organization": "DataAid",
            "url": "https://cdt-aimlac.org/cdt-data-aid.html",
            "start_date": "2024",
            "end_date": "Present",
            "description": "DataAid is a yearly student-led hackathon that aims to provide data science support to charities and non-profit organizations. As a committee member, I am responsible for helping to organize events, selecting charities that we are able to help on a technical level, as well as providing technical support to the hackathon."
        },
        {
            "title": "Astrophysics Developer Group co-Lead",
            "description": "I am a co-lead and organiser of the Astrophysics Developer Group at the University of Bristol. This an open group of PhD students and academics that meet weekly to discuss software development in their research. This includes discussing wins and issues that are coding related and a small talk/tutorial each week about a specific topic. Personally I have given talks on basic Web-developement, parallelisation and self-hosting.",
            "url":"https://github.com/astro-group-bristol/developer-group"
        },
        {
            "title":"LOC member for 2025 Simulation Based Inference for Galaxy Evolution Conference",
            "organization":"University of Bristol",
            "description":"I was a member of the local organizing committee for a small conference in Bristol. This was focused on Simulation based inference in astrophysics. I help chair dicussions and assisted in the running of the conference.",
            "url":"https://sbi-galev.github.io/2025/"
        }
    ],
    "awards": [
        {
            "name": "AIMLAC CDT PhD Studentship",
            "institution": "University of Bristol",
            "year": 2022,
            "description": "Awarded a fully funded PhD studentship from the AIMLAC CDT at the University of Bristol."
        },
        {
            "name": "BSc Research Project Commendation",
            "institution": "University of Bristol",
            "year": 2020,
            "description": "Commendation for my BSc research project on the bias in X-ray and SZ selected galaxy clusters using galaxy cluster scaling relations."
        }
    ],
    "skills": {
        "AI": [
            "Pytorch",
            "TensorFlow",
            "HuggingFace",
            "Transformers"
        ],
        "Programming": [
            "Python",
            "JavaScript",
            "LaTex",
            "Fortran",
            "C++",
            "Rust",
            "Typst"
        ],
        "Tools": [
            "Linux",
            "Git",
            "Docker",
            "HPC",
            "MongoDB",
            "HTMX",
            "FastAPI"
        ]
    },
    "projects": [
        {
            "name": "StiltsAgent",
            "description": "A LLM agent that helps generate commands for the Astrophysics software STILTS. This is a command line tool that is used to manipulate and analyse large astronomical datasets. This agent can interact with the STILTS documentation using a Retreval augemneted generation (RAG) approach and has a fine-tuned light-weight LLM to generate reliable commands.",
            "GitHub": "https://github.com/RhysAlfShaw/TopStiltsAgent"
        },
        {
            "name": "DRUID",
            "description": "One of my PhD projects, DRUID is a python package that preforms source finding on astronomical images using persistent homology.",
            "GitHub": "https://github.com/RhysAlfShaw/DRUID"
        },
        {
            "name": "Personal Website",
            "description": "My personal website, built using FastAPI and HTMX hosted on my self-hosted server.",
            "url": "https://rhysalfshaw.com"
        },
        {
            "name":"HomeLab",
            "description": "An ongoing project of mine is my home lab. A self-hosted server that runs a number of services including my personal website, an Immich cloud photo storage, a Zotero WebDAV cloud and a number of others. This is all run on a single server with a number of docker containers."
        }
    

    ],
    "bilbiography": "bilbiography.bib"
}